#pragma once

#include <bitset>

#include "../Utils/HMath.h"
#include "../Utils/Utils.h"
#include "CBlockLegacy.h"
#include "CEntityList.h"
#include "CInventory.h"
#include "CInventoryTransaction.h"
#include "TextHolder.h"
#include "Dimension.h"

class C_GameMode;

class Level {
private:
	char firstpad[0x688];  //0x8
public:
	int levelTicks;  //0x690
private:
	char secondpad[0x41C];  //0x694
public:
	int rayHitType;    //0xAB0
	int blockSide;     //0xAB4
	vec3_ti block;     //0xAB8
	vec3_t rayHitVec;  //0xAC4
private:
	C_Entity *entityPtr;          //0xAD0
	C_Entity *entityPtr2;         //0xAD8
	uint64_t GamingEntityFinder;  //0xAE0

	virtual void DONTREMOVEPLS();

public:
	bool hasEntity();       //to not go trough the entity list twice
	C_Entity *getEntity();  //returns the entity that the player is looking at
	int getLevelTicks() {
		//return levelTicks;
		return *reinterpret_cast<int *>(reinterpret_cast<__int64>(this) + 0x690);
	}

	class C_LoopbackPacketSender *getLoopbackPacketSender() {
		return *reinterpret_cast<class C_LoopbackPacketSender **>(reinterpret_cast<__int64>(this) + 0xA90);
	}
};

class C_Player;
class Dimension;
struct MobEffectInstance;

#pragma pack(push, 4)
class C_Entity {
public:
	uint64_t ptrToEntityList;  //0x0008
private:
	char pad_0010[296];  //0x0010
public:
	union {
		struct {
			float pitch;  //0x0138
			float yaw;    //0x013C
		};
		vec2_t viewAngles;
	};
	union {
		struct {
			float pitch2;  //0x0138
			float yaw2;    //0x013C
		};
		vec2_t viewAngles2;
	};

private:
	char pad_0148[16];  //0x0148
public:
	vec3_t eyePos0;  //0x0158
private:
	char pad_0164[112];  //0x0164
public:
	float fallDistance;  //0x01D4
	bool onGround;       //0x01D8
private:
	char pad_01D9[95];  //0x01D9
public:
	float stepHeight;  //0x0238
private:
	char pad_023C[16];  //0x023C
public:
	vec3_t slowdownFactor;  //0x024C
private:
	char pad_0258[5];  //0x0258
public:
	bool didEnterWaterBool;  //0x025D
private:
	char pad_025E[1];  //0x025E
public:
	bool hasEnteredWaterBool;  //0x025F
private:
	char pad_0260[72];  //0x0260
public:
	int32_t ticksAlive;  //0x02A8
private:
	char pad_02AC[172];  //0x02AC
public:
	class C_BlockSource *region;  //0x0358
private:
	char pad_0360[8];  //0x0360
public:
	Level *level;  //0x0368
private:
	char pad_0370[328];  //0x0370
public:
	AABB aabb;          //0x04B8
	float width;        //0x04D0
	float height;       //0x04D4
	vec3_t currentPos;  //0x04D8
	vec3_t oldPos;      //0x04E4
	vec3_t velocity;    //0x04F0
	vec3_t velocity2;   //0x04FC
private:
	char pad_0508[80];  //0x0508
public:
	int64_t entityRuntimeId;  //0x0558
private:
	char pad_0560[0x1C8];  //0x0560
public:
	float bodyYaw;                    //0x0728
	float oldBodyYaw;                 //0xtoolazytoupdatethesecommentsxd
	float yawUnused1;                 //0x0748
	float yawUnused2;                 //0x074C
	int32_t damageTime;               //0x0750
	int32_t damageAnimationDuration;  //0x0754
private:
	char pad_0758[136];  //0x0758
public:
	int32_t timeSinceDeath;  //0x07E0
private:
	char pad_07E4[244];  //0x07E4
public:
	class TextHolder playerName;  //0x08D8
private:
	char pad_08F8[140];  //0x08F8
public:
	bool canFly;  //0x0984
private:
	char pad_0985[1667];  //0x0985
public:
	int32_t ticksUsingItem;  //0x1008
private:
	char pad_100C[20];  //0x100C
public:
	int16_t itemData;  //0x1020
	int16_t itemId;    //0x1022
private:
	char pad_1024[508];  //0x1024
public:
	class C_InventoryTransactionManager transac;  //0x1220
private:
	char pad_1280[2828];  //0x1280
public:
	int32_t gamemode;  //0x1D8C

	virtual __int64 getLastHurtByMob(void);                                                 // 0
	virtual __int64 setLastHurtByMob(C_Entity *);                                           // 1
	virtual __int64 getLastHurtByC_Player(void);                                            // 2
	virtual __int64 setLastHurtByC_Player(C_Player *);                                      // 3
	virtual __int64 getLastHurtMob(void);                                                   // 4
	virtual __int64 setLastHurtMob(C_Entity *);                                             // 5
	virtual __int64 outOfWorld(void);                                                       // 6
	virtual __int64 reloadHardcoded();                                                      // 7
	virtual __int64 reloadHardcodedClient();                                                // 8
	virtual __int64 initializeComponents();                                                 // 9
