#pragma once

#include <bitset>

#include "../Utils/HMath.h"
#include "../Utils/Utils.h"
#include "BlockLegacy.h"
#include "Dimension.h"
#include "EntityList.h"
#include "Inventory.h"
#include "InventoryTransaction.h"
#include "TextHolder.h"

class GameMode;

class Level {
private:
	char pad_0x8[0x688];  // 0x8
public:
	int levelTicks;  // 0x690
private:
	char pad_0x694[0x444];  // 0x694
public:
	int rayHitType;               // 0xAD8
	int blockSide;                // 0xADC
	Vec3i block;                  // 0xAE0
	Vec3 rayHitVec;               // 0xAEC
	Entity *entityPtr;            // 0xAF8
	Entity *entityPtr2;           // 0xB00
	uint64_t GamingEntityFinder;  // 0xB08

	virtual void DONTREMOVEPLS();

public:
	bool hasEntity();     // to not go trough the entity list twice
	Entity *getEntity();  // returns the entity that the player is looking at
	int getLevelTicks() {
		// return levelTicks;
		return *reinterpret_cast<int *>(reinterpret_cast<__int64>(this) + 0x690);
	}

	class LoopbackPacketSender *getLoopbackPacketSender() {
		return *reinterpret_cast<class LoopbackPacketSender **>(reinterpret_cast<__int64>(this) + 0xA58);
	}

	void playSound(std::string sound, Vec3 const &position, float volume, float pitch) {
		using playSound_t = void(__fastcall *)(Level *, TextHolder *, Vec3 const &, float, float);
		static playSound_t func = reinterpret_cast<playSound_t>(Utils::getBase() + 0x2b76180);  // 48 89 5c 24 ? 48 89 6c 24 ? 48 89 74 24 ? 57 48 83 ec ? 48 8b 81 ? ? ? ? 33 ff 48 2b 81 ? ? ? ? 49 8b f0 48 c1 f8 ? 48 8b ea
		if (func != nullptr) func(this, &TextHolder(sound), position, volume, pitch);
	}

	// Credits to hacker hansen for this
	std::vector<Entity *> getMiscEntityList() {
		using entityList_t = std::int64_t *(__fastcall *)(Level *, void *);
		static entityList_t func = reinterpret_cast<entityList_t>(Utils::getBase() + 0x2b80090);  // 48 89 5c 24 ? 56 57 41 56 48 83 ec ? 48 8b 05 ? ? ? ? 48 33 c4 48 89 44 24 ? 48 8b f2 4c 8b f1 48 89 54 24 ? 33 c9
		if (func != nullptr) {
			std::unique_ptr<char[]> alloc = std::make_unique<char[]>(0x18);
			std::int64_t *listStart = func(this, alloc.get());
			std::size_t listSize = ((*reinterpret_cast<std::int64_t *>(reinterpret_cast<std::int64_t>(listStart) + 0x8)) - (*listStart)) / 0x8;
			Entity **entityList = reinterpret_cast<Entity **>(*listStart);
			std::vector<Entity *> res;
			res.reserve(listSize);
			if (listSize > 0 && listSize < 5000) {
				for (std::size_t i = 0; i < listSize; i++) res.push_back(entityList[i]);
			}
			return res;
		}
		return {};
	}
};

class Player;
class Dimension;
struct MobEffectInstance;

#pragma pack(push, 4)
class Entity {
private:
	char pad_0x8[0x130];  // 0x8
public:
	union {
		struct {
			float pitch; // 0x138
			float yaw;   // 0x13C
		};
		Vec2 viewAngles;
	};
	union {
		struct {
			float pitch2;  // 0x140
			float yaw2;    // 0x144
		};
		Vec2 viewAngles2;
	};
private:
	char pad_0x148[0x10];  // 0x148
public:
	Vec3 eyePos0;  // 0x158
private:
	char pad_0x164[0x70];  // 0x164
public:
	float fallDistance;  // 0x1D4
	bool onGround;       // 0x1D8
private:
	char pad_0x1D9[0x5F];  // 0x1D9
public:
	float stepHeight;  // 0x238
private:
	char pad_0x23C[0x10];  // 0x23C
public:
	Vec3 slowdownFactor;  // 0x24C
private:
	char pad_0x258[0x50];  // 0x258
public:
	int32_t ticksAlive;  // 0x2A8
private:
	char pad_0x2AC[0xAC];  // 0x2AC
public:
	BlockSource *region;   // 0x358
	Dimension *dimension;  // 0x360
	Level *level;          // 0x368
private:
	char pad_0x370[0x148];  // 0x370
public:
	AABB aabb;        // 0x4B8
	float width;      // 0x4D0
	float height;     // 0x4D4
	Vec3 currentPos;  // 0x4D8
	Vec3 oldPos;      // 0x4E4
	Vec3 velocity;    // 0x4F0
private:
	char pad_0x4FC[0x54];  // 0x4FC
public:
	int64_t entityRuntimeId;  // 0x550
private:
	char pad_0x558[0x1D0];  // 0x558
public:
	float bodyYaw;                    // 0x728
	float oldBodyYaw;                 // 0x72C
	float yawUnused1;                 // 0x730
	float yawUnused2;                 // 0x734
	int32_t damageTime;               // 0x738
	int32_t damageAnimationDuration;  // 0x73C
private:
	char pad_0x740[0x218];  // 0x740
public:
	bool isFlying;  // 0x958
private:
	char pad_0x959[0xB];  // 0x959
public:
	bool canFly;  // 0x964
private:
	char pad_0x965[0x1427];  // 0x965
public:
	int gamemode;  // 0x1D8C

	virtual __int64 getLastHurtByMob(void);                                             // 0
	virtual __int64 setLastHurtByMob(Entity *);                                         // 1
	virtual __int64 getLastHurtByPlayer(void);                                          // 2
	virtual __int64 setLastHurtByPlayer(Player *);                                      // 3
	virtual __int64 getLastHurtMob(void);                                               // 4
	virtual __int64 setLastHurtMob(Entity *);                                           // 5
	virtual __int64 outOfWorld(void);                                                   // 6
	virtual __int64 reloadHardcoded();                                                  // 7
	virtual __int64 reloadHardcodedClient();                                            // 8
	virtual __int64 initializeComponents();                                             // 9
